RT-Thread/rt-thread/bsp/stm32/libraries/STM32H5xx_HAL/STM32H5xx_HAL_Driver/Inc/stm32h5xx_hal_flash.h
/**
  * @brief  Get the FLASH Latency.
  * @retval FLASH Latency
  *         This return value can be one of the following values :
  *     @arg FLASH_LATENCY_0: FLASH Zero wait state
  *     @arg FLASH_LATENCY_1: FLASH One wait state
  *     @arg FLASH_LATENCY_2: FLASH Two wait states
  *     @arg FLASH_LATENCY_3: FLASH Three wait states
  *     @arg FLASH_LATENCY_4: FLASH Four wait states
  *     @arg FLASH_LATENCY_5: FLASH Five wait states
  *     @arg FLASH_LATENCY_6: FLASH Six wait states
  *     @arg FLASH_LATENCY_7: FLASH Seven wait states
  *     @arg FLASH_LATENCY_8: FLASH Eight wait states
  *     @arg FLASH_LATENCY_9: FLASH Nine wait states
  *     @arg FLASH_LATENCY_10: FLASH Ten wait states
  *     @arg FLASH_LATENCY_11: FLASH Eleven wait states
  *     @arg FLASH_LATENCY_12: FLASH Twelve wait states
  *     @arg FLASH_LATENCY_13: FLASH Thirteen wait states
  *     @arg FLASH_LATENCY_14: FLASH Fourteen wait states
  *     @arg FLASH_LATENCY_15: FLASH Fifteen wait states
  */
#define __HAL_FLASH_GET_LATENCY()               READ_BIT((FLASH->ACR), FLASH_ACR_LATENCY)

/**
  * @brief  Enable the specified FLASH interrupt.
  * @param  __INTERRUPT__ : FLASH interrupt
  *   This parameter can be any combination of the following values:
  *     @arg FLASH_IT_EOP       : End of FLASH Operation Interrupt
  *     @arg FLASH_IT_WRPERR    : Write Protection Error Interrupt
  *     @arg FLASH_IT_PGSERR    : Program Sequence Error Interrupt
  *     @arg FLASH_IT_STRBERR   : Strobe Error Interrupt
  *     @arg FLASH_IT_INCERR    : Inconsistency Error Interrupt
  *     @arg FLASH_IT_OBKERR    : OBK Error Interrupt
  *     @arg FLASH_IT_OBKWERR   : OBK Write Error Interrupt
  *     @arg FLASH_IT_OPTCHANGEERR : Option Byte Change Error Interrupt
  *     @arg FLASH_IT_ECCC      : Single ECC Error Correction Interrupt
  * @retval none
  */
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/* Enable secure FLASH interrupts from the secure world */
#define __HAL_FLASH_ENABLE_IT(__INTERRUPT__) do { if(((__INTERRUPT__) & FLASH_IT_ECCC) != 0U)                          \
                                                    { SET_BIT(FLASH->ECCCORR, FLASH_IT_ECCC); }                        \
                                                  if(((__INTERRUPT__) & FLASH_IT_OPTCHANGEERR) != 0U)                  \
                                                    { SET_BIT(FLASH->NSCR, FLASH_IT_OPTCHANGEERR); }                   \
                                                  if(((__INTERRUPT__) & (~FLASH_IT_ECCC)) != 0U)                       \
                                                    { SET_BIT(FLASH->SECCR, ((__INTERRUPT__) & (~(FLASH_IT_ECCC |      \
                                                      FLASH_IT_OPTCHANGEERR)))); }\
                                                } while(0)
/* Enable non-secure FLASH interrupts from the secure world */
#define __HAL_FLASH_ENABLE_IT_NS(__INTERRUPT__) do { if(((__INTERRUPT__) & FLASH_IT_ECCC) != 0U)                       \
                                                       { SET_BIT(FLASH->ECCCORR, FLASH_IT_ECCC); }                     \
                                                     if(((__INTERRUPT__) & (~FLASH_IT_ECCC)) != 0U)                    \
                                                       { SET_BIT(FLASH->NSCR, ((__INTERRUPT__) & (~FLASH_IT_ECCC))); } \
                                                   } while(0)
#else
/* Enable non-secure FLASH interrupts from the non-secure world */
#define __HAL_FLASH_ENABLE_IT(__INTERRUPT__)    do { if(((__INTERRUPT__) & FLASH_IT_ECCC) != 0U)                       \
                                                       { SET_BIT(FLASH->ECCCORR, FLASH_IT_ECCC); }                     \
                                                     if(((__INTERRUPT__) & (~FLASH_IT_ECCC)) != 0U)                    \
                                                       { SET_BIT(FLASH->NSCR, ((__INTERRUPT__) & (~FLASH_IT_ECCC))); } \
                                                   } while(0)
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Disable the specified FLASH interrupt.
  * @param  __INTERRUPT__ : FLASH interrupt
  *   This parameter can be any combination of the following values:
  *     @arg FLASH_IT_EOP       : End of FLASH Operation Interrupt
  *     @arg FLASH_IT_WRPERR    : Write Protection Error Interrupt
  *     @arg FLASH_IT_PGSERR    : Program Sequence Error Interrupt
  *     @arg FLASH_IT_STRBERR   : Strobe Error Interrupt
  *     @arg FLASH_IT_INCERR    : Inconsistency Error Interrupt
  *     @arg FLASH_IT_OBKERR    : OBK Error Interrupt
  *     @arg FLASH_IT_OBKWERR   : OBK Write Error Interrupt
  *     @arg FLASH_IT_OPTCHANGEERR : Option Byte Change Error Interrupt
  *     @arg FLASH_IT_ECCC      : Single ECC Error Correction Interrupt
  * @retval none
  */
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/* Disable secure FLASH interrupts from the secure world */
#define __HAL_FLASH_DISABLE_IT(__INTERRUPT__) do { if(((__INTERRUPT__) & FLASH_IT_ECCC) != 0U)                         \
                                                     { CLEAR_BIT(FLASH->ECCCORR, FLASH_IT_ECCC); }                     \
                                                   if(((__INTERRUPT__) & FLASH_IT_OPTCHANGEERR) != 0U)                 \
                                                     { CLEAR_BIT(FLASH->NSCR, FLASH_IT_OPTCHANGEERR); }                \
                                                   if(((__INTERRUPT__) & (~(FLASH_IT_ECCC | FLASH_IT_OPTCHANGEERR)))   \
                                                     != 0U){ CLEAR_BIT(FLASH->SECCR, ((__INTERRUPT__) &                \
                                                     (~(FLASH_IT_ECCC | FLASH_IT_OPTCHANGEERR)))); }\
                                                 } while(0)
/* Disable non-secure FLASH interrupts from the secure world */
#define __HAL_FLASH_DISABLE_IT_NS(__INTERRUPT__) do { if(((__INTERRUPT__) & FLASH_IT_ECCC) != 0U) { CLEAR_BIT          \
                                                        (FLASH->ECCCORR, FLASH_IT_ECCC); }                             \
                                                      if(((__INTERRUPT__) & (~FLASH_IT_ECCC)) != 0U)                   \
                                                        { CLEAR_BIT(FLASH->NSCR, ((__INTERRUPT__) & (~FLASH_IT_ECCC)));\
                                                        }                                                              \
                                                    } while(0)
#else
/* Disable non-secure FLASH interrupts from the non-secure world */
#define __HAL_FLASH_DISABLE_IT(__INTERRUPT__)   do { if(((__INTERRUPT__) & FLASH_IT_ECCC) != 0U) { CLEAR_BIT           \
                                                       (FLASH->ECCCORR, FLASH_IT_ECCC); }                              \
                                                     if(((__INTERRUPT__) & (~FLASH_IT_ECCC)) != 0U) { CLEAR_BIT        \
                                                       (FLASH->NSCR, ((__INTERRUPT__) & (~FLASH_IT_ECCC))); }          \
                                                    } while(0)
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Checks whether the specified FLASH flag is set or not.
  * @param  __FLAG__: specifies the FLASH flag to check.
  *   This parameter can be one of the following values :
  *     @arg FLASH_FLAG_BSY      : FLASH Busy flag
  *     @arg FLASH_FLAG_WBNE     : Write Buffer Not Empty flag
  *     @arg FLASH_FLAG_EOP      : End Of Operation flag
  *     @arg FLASH_FLAG_WRPERR   : Write Protection Error flag
  *     @arg FLASH_FLAG_PGSERR   : Program Sequence Error flag
  *     @arg FLASH_FLAG_STRBERR  : Strobe Error flag
  *     @arg FLASH_FLAG_INCERR   : Inconsistency Error flag
  *     @arg FLASH_FLAG_OBKERR   : OBK Error flag
  *     @arg FLASH_FLAG_OBKWERR  : OBK Write Error flag
  *     @arg FLASH_FLAG_OPTCHANGEERR : Option Byte Change Error flag
  *     @arg FLASH_FLAG_ECCC     : Single ECC Error Correction flag
  *     @arg FLASH_FLAG_ECCD     : Double Detection ECC Error flag
  * @retval The new state of FLASH_FLAG (SET or RESET).
  */
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/* Get secure FLASH flags from the secure world */
#define __HAL_FLASH_GET_FLAG(__FLAG__)          ((((__FLAG__) & (FLASH_FLAG_ECCC)) != 0U) ?                            \
                                                 (READ_BIT(FLASH->ECCCORR, (__FLAG__)) == (__FLAG__))  :               \
                                                 (((__FLAG__) & (FLASH_FLAG_ECCD)) != 0U) ?                            \
                                                 (READ_BIT(FLASH->ECCDETR, (__FLAG__)) == (__FLAG__))  :               \
                                                 ((((__FLAG__) & (FLASH_FLAG_OPTCHANGEERR)) != 0U) ?                   \
                                                  (READ_BIT(FLASH->NSSR, (__FLAG__)) == (__FLAG__)) :                  \
                                                  (READ_BIT(FLASH->SECSR, (__FLAG__)) == (__FLAG__))))
/* Get non-secure FLASH flags from the secure world */
#define __HAL_FLASH_GET_FLAG_NS(__FLAG__)       ((((__FLAG__) & (FLASH_FLAG_ECCC)) != 0U) ?                            \
                                                 (READ_BIT(FLASH->ECCCORR, (__FLAG__)) == (__FLAG__))  :               \
                                                 (((__FLAG__) & (FLASH_FLAG_ECCD)) != 0U) ?                            \
                                                 (READ_BIT(FLASH->ECCDETR, (__FLAG__)) == (__FLAG__))  :               \
                                                 (READ_BIT(FLASH->NSSR, (__FLAG__)) == (__FLAG__))))
#else
/* Get non-secure FLASH flags from the non-secure world */
#define __HAL_FLASH_GET_FLAG(__FLAG__)          ((((__FLAG__) & (FLASH_FLAG_ECCC)) != 0U) ?                            \
                                                 (READ_BIT(FLASH->ECCCORR, (__FLAG__)) == (__FLAG__))  :               \
                                                 (((__FLAG__) & (FLASH_FLAG_ECCD)) != 0U) ?                            \
                                                 (READ_BIT(FLASH->ECCDETR, (__FLAG__)) == (__FLAG__))  :               \
                                                 (READ_BIT(FLASH->NSSR, (__FLAG__)) == (__FLAG__)))
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Clear the specified FLASH flag.
  * @param  __FLAG__: specifies the FLASH flags to clear.
  *   This parameter can be one of the following values :
  *     @arg FLASH_FLAG_BSY       : FLASH Busy flag
  *     @arg FLASH_FLAG_WBNE      : Write Buffer Not Empty flag
  *     @arg FLASH_FLAG_EOP       : End Of Operation flag
  *     @arg FLASH_FLAG_WRPERR    : Write Protection Error flag
  *     @arg FLASH_FLAG_PGSERR    : Program Sequence Error flag
  *     @arg FLASH_FLAG_STRBERR   : Strobe Error flag
  *     @arg FLASH_FLAG_INCERR    : Inconsistency Error flag
  *     @arg FLASH_FLAG_OBKERR    : OBK Error flag
  *     @arg FLASH_FLAG_OBKWERR   : OBK Write Error flag
  *     @arg FLASH_FLAG_OPTCHANGEERR : Option Byte Change Error flag
  *     @arg FLASH_FLAG_ECCC      : Single ECC Error Correction flag
  *     @arg FLASH_FLAG_ECCD      : Double Detection ECC Error flag
  *     @arg FLASH_FLAG_ALL_ERRORS: All errors flags
  * @retval none
  */
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/* Clear secure FLASH flags from the secure world */
#define __HAL_FLASH_CLEAR_FLAG(__FLAG__)        do { if(((__FLAG__) & FLASH_FLAG_ECCC) != 0U) { SET_BIT(FLASH->ECCCORR,\
                                                        ((__FLAG__) & FLASH_FLAG_ECCC)); }                             \
                                                     if(((__FLAG__) & FLASH_FLAG_ECCD) != 0U) { SET_BIT(FLASH->ECCDETR,\
                                                        ((__FLAG__) & FLASH_FLAG_ECCD)); }                             \
                                                     if(((__FLAG__) & FLASH_FLAG_OPTCHANGEERR) != 0U) { SET_BIT        \
                                                         (FLASH->NSCCR, ((__FLAG__) & (FLASH_FLAG_OPTCHANGEERR))); }   \
                                                     if(((__FLAG__) & ~(FLASH_FLAG_ECCR_ERRORS |                       \
                                                          FLASH_FLAG_OPTCHANGEERR)) != 0U) { WRITE_REG(FLASH->SECCCR,  \
                                                        ((__FLAG__) & ~(FLASH_FLAG_ECCR_ERRORS |                       \
                                                          FLASH_FLAG_OPTCHANGEERR))); }                                \
                                                   } while(0)
/* Clear non-secure FLASH flags from the secure world */
#define __HAL_FLASH_CLEAR_FLAG_NS(__FLAG__)     do { if(((__FLAG__) & FLASH_FLAG_ECCC) != 0U) { SET_BIT(FLASH->ECCCORR,\
                                                        ((__FLAG__) & FLASH_FLAG_ECCC)); }                             \
                                                     if(((__FLAG__) & FLASH_FLAG_ECCD) != 0U) { SET_BIT(FLASH->ECCDETR,\
                                                        ((__FLAG__) & FLASH_FLAG_ECCD)); }                             \
                                                     if(((__FLAG__) & (~FLASH_FLAG_ECCR_ERRORS)) != 0U) { WRITE_REG    \
                                                         (FLASH->NSCCR, ((__FLAG__) & (~FLASH_FLAG_ECCR_ERRORS))); }   \
                                                   } while(0)
#else
/* Clear non-secure FLASH flags from the non-secure world */
#define __HAL_FLASH_CLEAR_FLAG(__FLAG__)        do { if(((__FLAG__) & FLASH_FLAG_ECCC) != 0U) { SET_BIT(FLASH->ECCCORR,\
                                                        ((__FLAG__) & FLASH_FLAG_ECCC)); }                             \
                                                     if(((__FLAG__) & FLASH_FLAG_ECCD) != 0U) { SET_BIT(FLASH->ECCDETR,\
                                                        ((__FLAG__) & FLASH_FLAG_ECCD)); }                             \
                                                     if(((__FLAG__) & (~FLASH_FLAG_ECCR_ERRORS)) != 0U) { WRITE_REG    \
                                                         (FLASH->NSCCR, ((__FLAG__) & (~FLASH_FLAG_ECCR_ERRORS))); }   \
                                                   } while(0)
#endif /* __ARM_FEATURE_CMSE */

/**
  * @}
  */

/* Include FLASH HAL Extension module */
#include "stm32h5xx_hal_flash_ex.h"

/* Exported functions --------------------------------------------------------*/
/** @addtogroup FLASH_Exported_Functions
  * @{
  */
/** @addtogroup FLASH_Exported_Functions_Group1
  * @{
  */
/* Program operation functions */
HAL_StatusTypeDef HAL_FLASH_Program(uint32_t TypeProgram, uint32_t FlashAddress, uint32_t DataAddress);
HAL_StatusTypeDef HAL_FLASH_Program_IT(uint32_t TypeProgram, uint32_t FlashAddress, uint32_t DataAddress);
/* FLASH IRQ handler method */
void HAL_FLASH_IRQHandler(void);
/* Callbacks in non blocking modes */
void HAL_FLASH_EndOfOperationCallback(uint32_t ReturnValue);
void HAL_FLASH_OperationErrorCallback(uint32_t ReturnValue);
/**
  * @}
  */

/** @addtogroup FLASH_Exported_Functions_Group2
  * @{
  */
/* Peripheral Control functions */
HAL_StatusTypeDef HAL_FLASH_Unlock(void);
HAL_StatusTypeDef HAL_FLASH_Lock(void);
HAL_StatusTypeDef HAL_FLASH_OB_Unlock(void);
HAL_StatusTypeDef HAL_FLASH_OB_Lock(void);
/* Option bytes control */
HAL_StatusTypeDef HAL_FLASH_OB_Launch(void);
/**
  * @}
  */

/** @addtogroup FLASH_Exported_Functions_Group3
  * @{
  */
/* Peripheral State functions */
uint32_t HAL_FLASH_GetError(void);
/**
  * @}
  */

/**
  * @}
  */
/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/** @defgroup FLASH_Private_Variables FLASH Private Variables
  * @{
  */
extern FLASH_ProcessTypeDef pFlash;
/**
  * @}
  */
/* Private constants ---------------------------------------------------------*/
/** @defgroup FLASH_Private_Constants FLASH Private Constants
  * @{
  */
#define FLASH_TIMEOUT_VALUE             1000U   /*!< 1 s */

#if defined (FLASH_SR_OBKERR)
#define FLASH_OBK                       0x10000000U
#endif /* FLASH_SR_OBKERR */

#define FLASH_OTP                       0x20000000U

