RT-Thread/rt-thread/bsp/stm32/libraries/STM32H5xx_HAL/STM32H5xx_HAL_Driver/Inc/stm32h5xx_hal_flash.h
#if defined (FLASH_EDATAR_EDATA_EN)
#define FLASH_EDATA                     0x40000000U
#endif /* FLASH_EDATAR_EDATA_EN */

#define FLASH_NON_SECURE_MASK           0x80000000U

#define FLASH_EDATA_SECTOR_NB           8U       /*!< Maximum number of FLASH high-cycle data sectors */
/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/** @defgroup FLASH_Private_Macros FLASH Private Macros
  * @{
  */
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
#if defined (FLASH_SR_OBKERR) && defined (FLASH_EDATAR_EDATA_EN)
#define IS_FLASH_TYPEPROGRAM(VALUE)      (((VALUE) == FLASH_TYPEPROGRAM_QUADWORD)                                   || \
                                          ((VALUE) == FLASH_TYPEPROGRAM_QUADWORD_NS)                                || \
                                          ((VALUE) == FLASH_TYPEPROGRAM_HALFWORD_OTP)                               || \
                                          ((VALUE) == FLASH_TYPEPROGRAM_HALFWORD_EDATA)                             || \
                                          ((VALUE) == FLASH_TYPEPROGRAM_HALFWORD_EDATA_NS)                          || \
                                          ((VALUE) == FLASH_TYPEPROGRAM_QUADWORD_OBK)                               || \
                                          ((VALUE) == FLASH_TYPEPROGRAM_QUADWORD_OBK_ALT))
#else
#define IS_FLASH_TYPEPROGRAM(VALUE)      (((VALUE) == FLASH_TYPEPROGRAM_QUADWORD)                                   || \
                                          ((VALUE) == FLASH_TYPEPROGRAM_QUADWORD_NS)                                || \
                                          ((VALUE) == FLASH_TYPEPROGRAM_HALFWORD_OTP))
#endif /* FLASH_SR_OBKERR && FLASH_EDATAR_EDATA_EN */
#else
#if defined (FLASH_SR_OBKERR) && defined (FLASH_EDATAR_EDATA_EN)
#define IS_FLASH_TYPEPROGRAM(VALUE)      (((VALUE) == FLASH_TYPEPROGRAM_QUADWORD)                                   || \
                                          ((VALUE) == FLASH_TYPEPROGRAM_HALFWORD_OTP)                               || \
                                          ((VALUE) == FLASH_TYPEPROGRAM_HALFWORD_EDATA)                             || \
                                          ((VALUE) == FLASH_TYPEPROGRAM_QUADWORD_OBK)                               || \
                                          ((VALUE) == FLASH_TYPEPROGRAM_QUADWORD_OBK_ALT))
#else
#define IS_FLASH_TYPEPROGRAM(VALUE)      (((VALUE) == FLASH_TYPEPROGRAM_QUADWORD)                                   || \
                                          ((VALUE) == FLASH_TYPEPROGRAM_HALFWORD_OTP))
#endif /* FLASH_SR_OBKERR && FLASH_EDATAR_EDATA_EN */
#endif /* __ARM_FEATURE_CMSE */

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
#define IS_FLASH_USER_MEM_ADDRESS(ADDRESS) ((((ADDRESS) >= FLASH_BASE) && ((ADDRESS) < (FLASH_BASE+FLASH_SIZE)))    || \
                                            (((ADDRESS) >= FLASH_BASE_NS) && ((ADDRESS) < (FLASH_BASE_NS+FLASH_SIZE))))
#if defined (FLASH_SR_OBKERR)
#define IS_FLASH_OBK_ADDRESS(ADDRESS)      ((((ADDRESS) >= FLASH_OBK_BASE)                                          && \
                                             ((ADDRESS)  < (FLASH_OBK_BASE+FLASH_OBK_SIZE)))                        || \
                                            (((ADDRESS) >= FLASH_OBK_BASE_NS)                                       && \
                                             ((ADDRESS)  < (FLASH_OBK_BASE_NS+FLASH_OBK_SIZE))))
#endif /* FLASH_SR_OBKERR */
#if defined (FLASH_EDATAR_EDATA_EN)
#define IS_FLASH_EDATA_ADDRESS(ADDRESS)    ((((ADDRESS) >= FLASH_EDATA_BASE_S)                                      && \
                                             ((ADDRESS)  < (FLASH_EDATA_BASE_S+FLASH_EDATA_SIZE)))                  || \
                                            (((ADDRESS) >= FLASH_EDATA_BASE_NS)                                     && \
                                             ((ADDRESS)  < (FLASH_EDATA_BASE_NS+FLASH_EDATA_SIZE))))
#endif /* FLASH_EDATAR_EDATA_EN */
#else
#define IS_FLASH_USER_MEM_ADDRESS(ADDRESS) (((ADDRESS) >= FLASH_BASE)                                               && \
                                            ((ADDRESS) < (FLASH_BASE+FLASH_SIZE)))
#if defined (FLASH_SR_OBKERR)
#define IS_FLASH_OBK_ADDRESS(ADDRESS)      (((ADDRESS) >= FLASH_OBK_BASE)                                           && \
                                            ((ADDRESS) < (FLASH_OBK_BASE + FLASH_OBK_SIZE)))
#endif /* FLASH_SR_OBKERR */
#if defined (FLASH_EDATAR_EDATA_EN)
#define IS_FLASH_EDATA_ADDRESS(ADDRESS)    (((ADDRESS) >= FLASH_EDATA_BASE_NS)                                      && \
                                            ((ADDRESS) < (FLASH_EDATA_BASE_NS + FLASH_EDATA_SIZE)))
#endif /* FLASH_EDATAR_EDATA_EN */
#endif /* __ARM_FEATURE_CMSE */

#define IS_FLASH_OTP_ADDRESS(ADDRESS)      (((ADDRESS) >= FLASH_OTP_BASE)                                           && \
                                            ((ADDRESS) < (FLASH_OTP_BASE + FLASH_OTP_SIZE)))

#define IS_FLASH_BANK(BANK)              (((BANK) == FLASH_BANK_1)                                                  || \
                                          ((BANK) == FLASH_BANK_2)                                                  || \
                                          ((BANK) == FLASH_BANK_BOTH))

#define IS_FLASH_BANK_EXCLUSIVE(BANK)    (((BANK) == FLASH_BANK_1)                                                  || \
                                          ((BANK) == FLASH_BANK_2))

#define IS_FLASH_SECTOR(SECTOR)          ((SECTOR) < FLASH_SECTOR_NB)

#define IS_FLASH_LATENCY(LATENCY)        (((LATENCY) == FLASH_LATENCY_0)                                            || \
                                          ((LATENCY) == FLASH_LATENCY_1)                                            || \
                                          ((LATENCY) == FLASH_LATENCY_2)                                            || \
                                          ((LATENCY) == FLASH_LATENCY_3)                                            || \
                                          ((LATENCY) == FLASH_LATENCY_4)                                            || \
                                          ((LATENCY) == FLASH_LATENCY_5)                                            || \
                                          ((LATENCY) == FLASH_LATENCY_6)                                            || \
                                          ((LATENCY) == FLASH_LATENCY_7)                                            || \
                                          ((LATENCY) == FLASH_LATENCY_8)                                            || \
                                          ((LATENCY) == FLASH_LATENCY_9)                                            || \
                                          ((LATENCY) == FLASH_LATENCY_10)                                           || \
                                          ((LATENCY) == FLASH_LATENCY_11)                                           || \
                                          ((LATENCY) == FLASH_LATENCY_12)                                           || \
                                          ((LATENCY) == FLASH_LATENCY_13)                                           || \
                                          ((LATENCY) == FLASH_LATENCY_14)                                           || \
                                          ((LATENCY) == FLASH_LATENCY_15))

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
#define IS_FLASH_SECURE_OPERATION()        ((pFlash.ProcedureOnGoing & FLASH_NON_SECURE_MASK) == 0U)
#else
#define IS_FLASH_SECURE_OPERATION()        (1U == 0U)
#endif /* __ARM_FEATURE_CMSE */
/**
  * @}
  */
/* Private functions ---------------------------------------------------------*/
/** @defgroup FLASH_Private_Functions FLASH Private Functions
  * @{
  */
HAL_StatusTypeDef FLASH_WaitForLastOperation(uint32_t Timeout);
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32H5xx_HAL_FLASH_H */
